{"_urlRewrite":null,"pageId":"/pages/blog","routeParams":{},"data":{"blogs":[{"title":"Hello World","content":"","type":"react","publishing_date":"2024-12-02","order":"!undefined","tokenID":2,"description":"I welcome you to my personal blog exploring technology, blockchain, and creative coding. Expect insights on modern web development, decentralized systems, and innovative digital experiences.","componentPath":"../blog/hello_world.mdx"},{"title":"Ideas behind the blog stack","content":"","type":"react","publishing_date":"2025-01-03","order":"!undefined","tokenID":"!undefined","description":"I share my journey from scattered notes to a unified blog using React and Vike. Modern web tech offers speed, simplicity, and full version control over traditional solutions.","componentPath":"../blog/blog_stack.md"},{"title":"Moving old lectures","content":"","type":"react","publishing_date":"2025-01-06","order":"!undefined","tokenID":"!undefined","description":"I migrate academic lectures from LaTeX to modern web formats. Discover solutions for handling equations, references, and static site generation in JavaScript environments.","componentPath":"../blog/moving_lectures.md"},{"title":"Are decentral websites a thing for me ?","content":"","type":"react","publishing_date":"2025-01-18","order":"!undefined","tokenID":"!undefined","description":"I explore decentralized web hosting using ENS domains and IPFS storage. Discover how blockchain enables censorship-resistant websites without traditional hosting companies.","componentPath":"../blog/ipfs.md"},{"title":"Is mirror.xyz a thing ?","content":"","type":"react","publishing_date":"2025-03-09","order":"!undefined","tokenID":"!undefined","description":"I discover Mirror.xyz - a decentralized publishing platform combining Medium-like writing with Ethereum monetization. ENS domains and crypto wallets enable seamless creator support.","componentPath":"../blog/mirror.md"},{"title":"Can I have interactive python pages ?","content":"","type":"react","publishing_date":"2025-03-11","order":"!undefined","tokenID":"!undefined","description":"I explore the future of interactive content with Python running directly in browsers. Tools like Pyodide and JupyterLite enable portable, installation-free data science.","componentPath":"../blog/finishing_amo.md"},{"title":"Running an image generator","content":"","type":"react","publishing_date":"2025-04-06","order":"!undefined","tokenID":"!undefined","description":"I build my own AI image generator using open-source models and European hosting. See how to integrate Stable Diffusion into static websites with full privacy and cost control.","componentPath":"../blog/images.md"},{"title":"A decentral support button","content":"","type":"react","publishing_date":"2025-04-21","order":"!undefined","tokenID":"!undefined","description":"I build a decentralized support button using smart contracts for direct content monetization. Learn how blockchain enables transparent micro-payments without platform intermediaries.","componentPath":"../blog/decentral_like.md"},{"title":"My short lived contact with the world of VCs in Germany","content":"","type":"react","publishing_date":"2025-05-14","order":"!undefined","tokenID":"!undefined","description":"I explore the challenges of transitioning from quantum research to startup entrepreneurship. Valuable lessons about VC funding, deep tech development, and German startup realities.","componentPath":"../blog/vc_lessons.md"},{"title":"Generating AI images, paying anonymously and little","content":"","type":"react","publishing_date":"2025-05-20","order":"!undefined","tokenID":"!undefined","description":"I implement anonymous micro-payments for AI image generation using Ethereum Layer-2. See how to connect blockchain payments with serverless AI for sustainable, privacy-focused services.","componentPath":"../blog/nft_blog.md"},{"title":"Updates to the website","content":"","type":"react","publishing_date":"2025-05-26","order":"!undefined","tokenID":26,"description":"I explore my website's evolution over 6 months, from minimal CSS to Panda CSS and Copilot refactoring. See how modern tools dramatically boost development productivity.","componentPath":"../blog/blog_updates.md"},{"title":"A gallery of AI images","content":"","type":"react","publishing_date":"2025-06-03","order":"!undefined","tokenID":24,"description":"I build an NFT gallery for AI-generated images using ERC-721 Enumerable contracts. Learn how to upgrade smart contracts and create integrated user experiences for collectibles.","componentPath":"../blog/nft_gallery.md"},{"title":"A public gallery of AI generated images","content":"","type":"react","publishing_date":"2025-06-18","order":"!undefined","tokenID":23,"description":"I create a privacy-focused AI image gallery where creators share work and collectors mint NFTs. Discover the technical details combining open-source generation with blockchain incentives.","componentPath":"../blog/collect_imagegen.md"},{"title":"The Prisoner's Dilemma","content":"","type":"react","publishing_date":"2025-06-25","order":"!undefined","tokenID":30,"description":"I explore the Prisoner's Dilemma through interactive game theory simulations. Discover strategic decision-making, Nash equilibrium, and how cooperation emerges in competition.","componentPath":"../blog/prisoners_dilemma_interactive.tsx"},{"title":"Tale of Four Islands: Solutions to the Tragedy of the Commons","content":"","type":"react","publishing_date":"2025-07-21","order":"!undefined","tokenID":35,"description":"I explore solutions to the Tragedy of the Commons through interactive island simulations. See how governance models affect resource sustainability and community outcomes.","componentPath":"../blog/tragedy_of_commons_fishing.tsx"},{"title":" Merkle Trees for LLM Batching - The fundamentals","content":"","type":"react","publishing_date":"2025-07-29","order":"!undefined","tokenID":38,"description":"I explore the fundamentals of Merkle trees for efficient LLM batching. Learn cryptographic proofs, batch verification, and AI service settlement optimization.","componentPath":"../blog/merkle_ai_batching_fundamentals.tsx"},{"title":"My AI Assistant That Takes ETH Instead of Subscriptions","content":"","type":"react","publishing_date":"2025-08-28","order":"!undefined","tokenID":41,"description":"I build an AI assistant that accepts Ethereum payments instead of subscriptions. Discover how Merkle batching enables efficient prepaid AI with instant responses.","componentPath":"../blog/merkle_ai_batching.tsx"},{"title":"Can we decentralize access to quantum computing with smart contracts ?","content":"","type":"react","publishing_date":"2025-10-02","order":"!undefined","tokenID":123,"description":"I explore how smart contracts can democratize access to quantum computing resources, enabling privacy-preserving decentralized payments and encrypted NFT results.","componentPath":"../blog/smart_quantum.md"}]}}